Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEmemram_bf.h
/**
 * \file IfxEmem_ram_bf.h
 * \brief
 * \copyright Copyright (c) 2015 Infineon Technologies AG. All rights reserved.
 *
 *
 * Date: 2015-12-17 16:15:02 GMT
 * Version: TBD
 * Specification: TBD
 * MAY BE CHANGED BY USER [yes/no]: No
 *
 *                                 IMPORTANT NOTICE
 *
 *
 * Infineon Technologies AG (Infineon) is supplying this file for use
 * exclusively with Infineon's microcontroller products. This file can be freely
 * distributed within development tools that are supporting such microcontroller
 * products.
 *
 * THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
 * OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
 * INFINEON SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL,
 * OR CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 * \defgroup IfxLld_Emem_ram_Registers_BitfieldsMask Bitfields mask and offset
 * \ingroup IfxLld_Emem_ram_Registers
 * 
 */
#ifndef IFXEMEM_RAM_BF_H
#define IFXEMEM_RAM_BF_H 1
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Emem_ram_BitfieldsMask
 * \{  */
/** \brief Length for Ifx_EMEM_RAM_CLC_Bits.DISR */
#define IFX_EMEM_RAM_CLC_DISR_LEN (1u)

/** \brief Mask for Ifx_EMEM_RAM_CLC_Bits.DISR */
#define IFX_EMEM_RAM_CLC_DISR_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_RAM_CLC_Bits.DISR */
#define IFX_EMEM_RAM_CLC_DISR_OFF (0u)

/** \brief Length for Ifx_EMEM_RAM_CLC_Bits.DISS */
#define IFX_EMEM_RAM_CLC_DISS_LEN (1u)

/** \brief Mask for Ifx_EMEM_RAM_CLC_Bits.DISS */
#define IFX_EMEM_RAM_CLC_DISS_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_RAM_CLC_Bits.DISS */
#define IFX_EMEM_RAM_CLC_DISS_OFF (1u)

/** \brief Length for Ifx_EMEM_RAM_MODID_Bits.ID_VALUE */
#define IFX_EMEM_RAM_MODID_ID_VALUE_LEN (32u)

/** \brief Mask for Ifx_EMEM_RAM_MODID_Bits.ID_VALUE */
#define IFX_EMEM_RAM_MODID_ID_VALUE_MSK (0xffffffffu)

/** \brief Offset for Ifx_EMEM_RAM_MODID_Bits.ID_VALUE */
#define IFX_EMEM_RAM_MODID_ID_VALUE_OFF (0u)

/** \brief Length for Ifx_EMEM_RAM_ACCEN0_Bits.EN0 */
#define IFX_EMEM_RAM_ACCEN0_EN0_LEN (1u)

/** \brief Mask for Ifx_EMEM_RAM_ACCEN0_Bits.EN0 */
#define IFX_EMEM_RAM_ACCEN0_EN0_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_RAM_ACCEN0_Bits.EN0 */
#define IFX_EMEM_RAM_ACCEN0_EN0_OFF (0u)

/** \brief Length for Ifx_EMEM_RAM_ACCEN0_Bits.EN1 */
#define IFX_EMEM_RAM_ACCEN0_EN1_LEN (1u)

/** \brief Mask for Ifx_EMEM_RAM_ACCEN0_Bits.EN1 */
#define IFX_EMEM_RAM_ACCEN0_EN1_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_RAM_ACCEN0_Bits.EN1 */
#define IFX_EMEM_RAM_ACCEN0_EN1_OFF (1u)

/** \brief Length for Ifx_EMEM_RAM_ACCEN0_Bits.EN2 */
#define IFX_EMEM_RAM_ACCEN0_EN2_LEN (1u)

/** \brief Mask for Ifx_EMEM_RAM_ACCEN0_Bits.EN2 */
#define IFX_EMEM_RAM_ACCEN0_EN2_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_RAM_ACCEN0_Bits.EN2 */
#define IFX_EMEM_RAM_ACCEN0_EN2_OFF (2u)

/** \brief Length for Ifx_EMEM_RAM_ACCEN0_Bits.EN3 */
#define IFX_EMEM_RAM_ACCEN0_EN3_LEN (1u)

/** \brief Mask for Ifx_EMEM_RAM_ACCEN0_Bits.EN3 */
#define IFX_EMEM_RAM_ACCEN0_EN3_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_RAM_ACCEN0_Bits.EN3 */
#define IFX_EMEM_RAM_ACCEN0_EN3_OFF (3u)

/** \brief Length for Ifx_EMEM_RAM_ACCEN0_Bits.EN4 */
#define IFX_EMEM_RAM_ACCEN0_EN4_LEN (1u)

/** \brief Mask for Ifx_EMEM_RAM_ACCEN0_Bits.EN4 */
#define IFX_EMEM_RAM_ACCEN0_EN4_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_RAM_ACCEN0_Bits.EN4 */
#define IFX_EMEM_RAM_ACCEN0_EN4_OFF (4u)

/** \brief Length for Ifx_EMEM_RAM_ACCEN0_Bits.EN5 */
#define IFX_EMEM_RAM_ACCEN0_EN5_LEN (1u)

/** \brief Mask for Ifx_EMEM_RAM_ACCEN0_Bits.EN5 */
#define IFX_EMEM_RAM_ACCEN0_EN5_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_RAM_ACCEN0_Bits.EN5 */
#define IFX_EMEM_RAM_ACCEN0_EN5_OFF (5u)

/** \brief Length for Ifx_EMEM_RAM_ACCEN0_Bits.EN6 */
#define IFX_EMEM_RAM_ACCEN0_EN6_LEN (1u)

/** \brief Mask for Ifx_EMEM_RAM_ACCEN0_Bits.EN6 */
#define IFX_EMEM_RAM_ACCEN0_EN6_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_RAM_ACCEN0_Bits.EN6 */
#define IFX_EMEM_RAM_ACCEN0_EN6_OFF (6u)

/** \brief Length for Ifx_EMEM_RAM_ACCEN0_Bits.EN7 */
#define IFX_EMEM_RAM_ACCEN0_EN7_LEN (1u)

/** \brief Mask for Ifx_EMEM_RAM_ACCEN0_Bits.EN7 */
#define IFX_EMEM_RAM_ACCEN0_EN7_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_RAM_ACCEN0_Bits.EN7 */
#define IFX_EMEM_RAM_ACCEN0_EN7_OFF (7u)

/** \brief Length for Ifx_EMEM_RAM_ACCEN0_Bits.EN8 */
#define IFX_EMEM_RAM_ACCEN0_EN8_LEN (1u)

/** \brief Mask for Ifx_EMEM_RAM_ACCEN0_Bits.EN8 */
#define IFX_EMEM_RAM_ACCEN0_EN8_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_RAM_ACCEN0_Bits.EN8 */
#define IFX_EMEM_RAM_ACCEN0_EN8_OFF (8u)

/** \brief Length for Ifx_EMEM_RAM_ACCEN0_Bits.EN9 */
#define IFX_EMEM_RAM_ACCEN0_EN9_LEN (1u)

/** \brief Mask for Ifx_EMEM_RAM_ACCEN0_Bits.EN9 */
#define IFX_EMEM_RAM_ACCEN0_EN9_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_RAM_ACCEN0_Bits.EN9 */
#define IFX_EMEM_RAM_ACCEN0_EN9_OFF (9u)

/** \brief Length for Ifx_EMEM_RAM_ACCEN0_Bits.EN10 */
#define IFX_EMEM_RAM_ACCEN0_EN10_LEN (1u)

/** \brief Mask for Ifx_EMEM_RAM_ACCEN0_Bits.EN10 */
#define IFX_EMEM_RAM_ACCEN0_EN10_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_RAM_ACCEN0_Bits.EN10 */
#define IFX_EMEM_RAM_ACCEN0_EN10_OFF (10u)

/** \brief Length for Ifx_EMEM_RAM_ACCEN0_Bits.EN11 */
#define IFX_EMEM_RAM_ACCEN0_EN11_LEN (1u)

/** \brief Mask for Ifx_EMEM_RAM_ACCEN0_Bits.EN11 */
#define IFX_EMEM_RAM_ACCEN0_EN11_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_RAM_ACCEN0_Bits.EN11 */
#define IFX_EMEM_RAM_ACCEN0_EN11_OFF (11u)

/** \brief Length for Ifx_EMEM_RAM_ACCEN0_Bits.EN12 */
#define IFX_EMEM_RAM_ACCEN0_EN12_LEN (1u)

/** \brief Mask for Ifx_EMEM_RAM_ACCEN0_Bits.EN12 */
#define IFX_EMEM_RAM_ACCEN0_EN12_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_RAM_ACCEN0_Bits.EN12 */
#define IFX_EMEM_RAM_ACCEN0_EN12_OFF (12u)

/** \brief Length for Ifx_EMEM_RAM_ACCEN0_Bits.EN13 */
#define IFX_EMEM_RAM_ACCEN0_EN13_LEN (1u)

/** \brief Mask for Ifx_EMEM_RAM_ACCEN0_Bits.EN13 */
#define IFX_EMEM_RAM_ACCEN0_EN13_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_RAM_ACCEN0_Bits.EN13 */
#define IFX_EMEM_RAM_ACCEN0_EN13_OFF (13u)

/** \brief Length for Ifx_EMEM_RAM_ACCEN0_Bits.EN14 */
#define IFX_EMEM_RAM_ACCEN0_EN14_LEN (1u)

/** \brief Mask for Ifx_EMEM_RAM_ACCEN0_Bits.EN14 */
#define IFX_EMEM_RAM_ACCEN0_EN14_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_RAM_ACCEN0_Bits.EN14 */
#define IFX_EMEM_RAM_ACCEN0_EN14_OFF (14u)

/** \brief Length for Ifx_EMEM_RAM_ACCEN0_Bits.EN15 */
#define IFX_EMEM_RAM_ACCEN0_EN15_LEN (1u)

/** \brief Mask for Ifx_EMEM_RAM_ACCEN0_Bits.EN15 */
#define IFX_EMEM_RAM_ACCEN0_EN15_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_RAM_ACCEN0_Bits.EN15 */
#define IFX_EMEM_RAM_ACCEN0_EN15_OFF (15u)

/** \brief Length for Ifx_EMEM_RAM_ACCEN0_Bits.EN16 */
#define IFX_EMEM_RAM_ACCEN0_EN16_LEN (1u)

/** \brief Mask for Ifx_EMEM_RAM_ACCEN0_Bits.EN16 */
#define IFX_EMEM_RAM_ACCEN0_EN16_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_RAM_ACCEN0_Bits.EN16 */
#define IFX_EMEM_RAM_ACCEN0_EN16_OFF (16u)

