Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEmemram_bf.h
/** \brief Length for Ifx_EMEM_RAM_ACCEN0_Bits.EN17 */
#define IFX_EMEM_RAM_ACCEN0_EN17_LEN (1u)

/** \brief Mask for Ifx_EMEM_RAM_ACCEN0_Bits.EN17 */
#define IFX_EMEM_RAM_ACCEN0_EN17_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_RAM_ACCEN0_Bits.EN17 */
#define IFX_EMEM_RAM_ACCEN0_EN17_OFF (17u)

/** \brief Length for Ifx_EMEM_RAM_ACCEN0_Bits.EN18 */
#define IFX_EMEM_RAM_ACCEN0_EN18_LEN (1u)

/** \brief Mask for Ifx_EMEM_RAM_ACCEN0_Bits.EN18 */
#define IFX_EMEM_RAM_ACCEN0_EN18_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_RAM_ACCEN0_Bits.EN18 */
#define IFX_EMEM_RAM_ACCEN0_EN18_OFF (18u)

/** \brief Length for Ifx_EMEM_RAM_ACCEN0_Bits.EN19 */
#define IFX_EMEM_RAM_ACCEN0_EN19_LEN (1u)

/** \brief Mask for Ifx_EMEM_RAM_ACCEN0_Bits.EN19 */
#define IFX_EMEM_RAM_ACCEN0_EN19_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_RAM_ACCEN0_Bits.EN19 */
#define IFX_EMEM_RAM_ACCEN0_EN19_OFF (19u)

/** \brief Length for Ifx_EMEM_RAM_ACCEN0_Bits.EN20 */
#define IFX_EMEM_RAM_ACCEN0_EN20_LEN (1u)

/** \brief Mask for Ifx_EMEM_RAM_ACCEN0_Bits.EN20 */
#define IFX_EMEM_RAM_ACCEN0_EN20_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_RAM_ACCEN0_Bits.EN20 */
#define IFX_EMEM_RAM_ACCEN0_EN20_OFF (20u)

/** \brief Length for Ifx_EMEM_RAM_ACCEN0_Bits.EN21 */
#define IFX_EMEM_RAM_ACCEN0_EN21_LEN (1u)

/** \brief Mask for Ifx_EMEM_RAM_ACCEN0_Bits.EN21 */
#define IFX_EMEM_RAM_ACCEN0_EN21_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_RAM_ACCEN0_Bits.EN21 */
#define IFX_EMEM_RAM_ACCEN0_EN21_OFF (21u)

/** \brief Length for Ifx_EMEM_RAM_ACCEN0_Bits.EN22 */
#define IFX_EMEM_RAM_ACCEN0_EN22_LEN (1u)

/** \brief Mask for Ifx_EMEM_RAM_ACCEN0_Bits.EN22 */
#define IFX_EMEM_RAM_ACCEN0_EN22_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_RAM_ACCEN0_Bits.EN22 */
#define IFX_EMEM_RAM_ACCEN0_EN22_OFF (22u)

/** \brief Length for Ifx_EMEM_RAM_ACCEN0_Bits.EN23 */
#define IFX_EMEM_RAM_ACCEN0_EN23_LEN (1u)

/** \brief Mask for Ifx_EMEM_RAM_ACCEN0_Bits.EN23 */
#define IFX_EMEM_RAM_ACCEN0_EN23_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_RAM_ACCEN0_Bits.EN23 */
#define IFX_EMEM_RAM_ACCEN0_EN23_OFF (23u)

/** \brief Length for Ifx_EMEM_RAM_ACCEN0_Bits.EN24 */
#define IFX_EMEM_RAM_ACCEN0_EN24_LEN (1u)

/** \brief Mask for Ifx_EMEM_RAM_ACCEN0_Bits.EN24 */
#define IFX_EMEM_RAM_ACCEN0_EN24_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_RAM_ACCEN0_Bits.EN24 */
#define IFX_EMEM_RAM_ACCEN0_EN24_OFF (24u)

/** \brief Length for Ifx_EMEM_RAM_ACCEN0_Bits.EN25 */
#define IFX_EMEM_RAM_ACCEN0_EN25_LEN (1u)

/** \brief Mask for Ifx_EMEM_RAM_ACCEN0_Bits.EN25 */
#define IFX_EMEM_RAM_ACCEN0_EN25_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_RAM_ACCEN0_Bits.EN25 */
#define IFX_EMEM_RAM_ACCEN0_EN25_OFF (25u)

/** \brief Length for Ifx_EMEM_RAM_ACCEN0_Bits.EN26 */
#define IFX_EMEM_RAM_ACCEN0_EN26_LEN (1u)

/** \brief Mask for Ifx_EMEM_RAM_ACCEN0_Bits.EN26 */
#define IFX_EMEM_RAM_ACCEN0_EN26_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_RAM_ACCEN0_Bits.EN26 */
#define IFX_EMEM_RAM_ACCEN0_EN26_OFF (26u)

/** \brief Length for Ifx_EMEM_RAM_ACCEN0_Bits.EN27 */
#define IFX_EMEM_RAM_ACCEN0_EN27_LEN (1u)

/** \brief Mask for Ifx_EMEM_RAM_ACCEN0_Bits.EN27 */
#define IFX_EMEM_RAM_ACCEN0_EN27_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_RAM_ACCEN0_Bits.EN27 */
#define IFX_EMEM_RAM_ACCEN0_EN27_OFF (27u)

/** \brief Length for Ifx_EMEM_RAM_ACCEN0_Bits.EN28 */
#define IFX_EMEM_RAM_ACCEN0_EN28_LEN (1u)

/** \brief Mask for Ifx_EMEM_RAM_ACCEN0_Bits.EN28 */
#define IFX_EMEM_RAM_ACCEN0_EN28_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_RAM_ACCEN0_Bits.EN28 */
#define IFX_EMEM_RAM_ACCEN0_EN28_OFF (28u)

/** \brief Length for Ifx_EMEM_RAM_ACCEN0_Bits.EN29 */
#define IFX_EMEM_RAM_ACCEN0_EN29_LEN (1u)

/** \brief Mask for Ifx_EMEM_RAM_ACCEN0_Bits.EN29 */
#define IFX_EMEM_RAM_ACCEN0_EN29_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_RAM_ACCEN0_Bits.EN29 */
#define IFX_EMEM_RAM_ACCEN0_EN29_OFF (29u)

/** \brief Length for Ifx_EMEM_RAM_ACCEN0_Bits.EN30 */
#define IFX_EMEM_RAM_ACCEN0_EN30_LEN (1u)

/** \brief Mask for Ifx_EMEM_RAM_ACCEN0_Bits.EN30 */
#define IFX_EMEM_RAM_ACCEN0_EN30_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_RAM_ACCEN0_Bits.EN30 */
#define IFX_EMEM_RAM_ACCEN0_EN30_OFF (30u)

/** \brief Length for Ifx_EMEM_RAM_ACCEN0_Bits.EN31 */
#define IFX_EMEM_RAM_ACCEN0_EN31_LEN (1u)

/** \brief Mask for Ifx_EMEM_RAM_ACCEN0_Bits.EN31 */
#define IFX_EMEM_RAM_ACCEN0_EN31_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_RAM_ACCEN0_Bits.EN31 */
#define IFX_EMEM_RAM_ACCEN0_EN31_OFF (31u)

/** \brief Length for Ifx_EMEM_RAM_MEMCON_Bits.RES */
#define IFX_EMEM_RAM_MEMCON_RES_LEN (2u)

/** \brief Mask for Ifx_EMEM_RAM_MEMCON_Bits.RES */
#define IFX_EMEM_RAM_MEMCON_RES_MSK (0x3u)

/** \brief Offset for Ifx_EMEM_RAM_MEMCON_Bits.RES */
#define IFX_EMEM_RAM_MEMCON_RES_OFF (0u)

/** \brief Length for Ifx_EMEM_RAM_MEMCON_Bits.INTERR */
#define IFX_EMEM_RAM_MEMCON_INTERR_LEN (1u)

/** \brief Mask for Ifx_EMEM_RAM_MEMCON_Bits.INTERR */
#define IFX_EMEM_RAM_MEMCON_INTERR_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_RAM_MEMCON_Bits.INTERR */
#define IFX_EMEM_RAM_MEMCON_INTERR_OFF (2u)

/** \brief Length for Ifx_EMEM_RAM_MEMCON_Bits.RMWERR */
#define IFX_EMEM_RAM_MEMCON_RMWERR_LEN (1u)

/** \brief Mask for Ifx_EMEM_RAM_MEMCON_Bits.RMWERR */
#define IFX_EMEM_RAM_MEMCON_RMWERR_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_RAM_MEMCON_Bits.RMWERR */
#define IFX_EMEM_RAM_MEMCON_RMWERR_OFF (4u)

/** \brief Length for Ifx_EMEM_RAM_MEMCON_Bits.DATAERR */
#define IFX_EMEM_RAM_MEMCON_DATAERR_LEN (1u)

/** \brief Mask for Ifx_EMEM_RAM_MEMCON_Bits.DATAERR */
#define IFX_EMEM_RAM_MEMCON_DATAERR_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_RAM_MEMCON_Bits.DATAERR */
#define IFX_EMEM_RAM_MEMCON_DATAERR_OFF (6u)

/** \brief Length for Ifx_EMEM_RAM_MEMCON_Bits.ADDERR */
#define IFX_EMEM_RAM_MEMCON_ADDERR_LEN (1u)

/** \brief Mask for Ifx_EMEM_RAM_MEMCON_Bits.ADDERR */
#define IFX_EMEM_RAM_MEMCON_ADDERR_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_RAM_MEMCON_Bits.ADDERR */
#define IFX_EMEM_RAM_MEMCON_ADDERR_OFF (7u)

/** \brief Length for Ifx_EMEM_RAM_MEMCON_Bits.PMIC */
#define IFX_EMEM_RAM_MEMCON_PMIC_LEN (1u)

/** \brief Mask for Ifx_EMEM_RAM_MEMCON_Bits.PMIC */
#define IFX_EMEM_RAM_MEMCON_PMIC_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_RAM_MEMCON_Bits.PMIC */
#define IFX_EMEM_RAM_MEMCON_PMIC_OFF (8u)

/** \brief Length for Ifx_EMEM_RAM_MEMCON_Bits.ERRDIS */
#define IFX_EMEM_RAM_MEMCON_ERRDIS_LEN (1u)

/** \brief Mask for Ifx_EMEM_RAM_MEMCON_Bits.ERRDIS */
#define IFX_EMEM_RAM_MEMCON_ERRDIS_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_RAM_MEMCON_Bits.ERRDIS */
#define IFX_EMEM_RAM_MEMCON_ERRDIS_OFF (9u)

