Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEmemram_bf.h
/** \brief Length for Ifx_EMEM_RAM_SCTRL_Bits.GED */
#define IFX_EMEM_RAM_SCTRL_GED_LEN (1u)

/** \brief Mask for Ifx_EMEM_RAM_SCTRL_Bits.GED */
#define IFX_EMEM_RAM_SCTRL_GED_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_RAM_SCTRL_Bits.GED */
#define IFX_EMEM_RAM_SCTRL_GED_OFF (0u)

/** \brief Length for Ifx_EMEM_RAM_SCTRL_Bits.GEC */
#define IFX_EMEM_RAM_SCTRL_GEC_LEN (1u)

/** \brief Mask for Ifx_EMEM_RAM_SCTRL_Bits.GEC */
#define IFX_EMEM_RAM_SCTRL_GEC_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_RAM_SCTRL_Bits.GEC */
#define IFX_EMEM_RAM_SCTRL_GEC_OFF (1u)

/** \brief Length for Ifx_EMEM_RAM_RGN_LA_Bits.ADDR */
#define IFX_EMEM_RAM_RGN_LA_ADDR_LEN (23u)

/** \brief Mask for Ifx_EMEM_RAM_RGN_LA_Bits.ADDR */
#define IFX_EMEM_RAM_RGN_LA_ADDR_MSK (0x7fffffu)

/** \brief Offset for Ifx_EMEM_RAM_RGN_LA_Bits.ADDR */
#define IFX_EMEM_RAM_RGN_LA_ADDR_OFF (5u)

/** \brief Length for Ifx_EMEM_RAM_RGN_UA_Bits.ADDR */
#define IFX_EMEM_RAM_RGN_UA_ADDR_LEN (24u)

/** \brief Mask for Ifx_EMEM_RAM_RGN_UA_Bits.ADDR */
#define IFX_EMEM_RAM_RGN_UA_ADDR_MSK (0xffffffu)

/** \brief Offset for Ifx_EMEM_RAM_RGN_UA_Bits.ADDR */
#define IFX_EMEM_RAM_RGN_UA_ADDR_OFF (5u)

/** \brief Length for Ifx_EMEM_RAM_RGN_ACCENWA_Bits.EN0 */
#define IFX_EMEM_RAM_RGN_ACCENWA_EN0_LEN (1u)

/** \brief Mask for Ifx_EMEM_RAM_RGN_ACCENWA_Bits.EN0 */
#define IFX_EMEM_RAM_RGN_ACCENWA_EN0_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_RAM_RGN_ACCENWA_Bits.EN0 */
#define IFX_EMEM_RAM_RGN_ACCENWA_EN0_OFF (0u)

/** \brief Length for Ifx_EMEM_RAM_RGN_ACCENWA_Bits.EN1 */
#define IFX_EMEM_RAM_RGN_ACCENWA_EN1_LEN (1u)

/** \brief Mask for Ifx_EMEM_RAM_RGN_ACCENWA_Bits.EN1 */
#define IFX_EMEM_RAM_RGN_ACCENWA_EN1_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_RAM_RGN_ACCENWA_Bits.EN1 */
#define IFX_EMEM_RAM_RGN_ACCENWA_EN1_OFF (1u)

/** \brief Length for Ifx_EMEM_RAM_RGN_ACCENWA_Bits.EN2 */
#define IFX_EMEM_RAM_RGN_ACCENWA_EN2_LEN (1u)

/** \brief Mask for Ifx_EMEM_RAM_RGN_ACCENWA_Bits.EN2 */
#define IFX_EMEM_RAM_RGN_ACCENWA_EN2_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_RAM_RGN_ACCENWA_Bits.EN2 */
#define IFX_EMEM_RAM_RGN_ACCENWA_EN2_OFF (2u)

/** \brief Length for Ifx_EMEM_RAM_RGN_ACCENWA_Bits.EN3 */
#define IFX_EMEM_RAM_RGN_ACCENWA_EN3_LEN (1u)

/** \brief Mask for Ifx_EMEM_RAM_RGN_ACCENWA_Bits.EN3 */
#define IFX_EMEM_RAM_RGN_ACCENWA_EN3_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_RAM_RGN_ACCENWA_Bits.EN3 */
#define IFX_EMEM_RAM_RGN_ACCENWA_EN3_OFF (3u)

/** \brief Length for Ifx_EMEM_RAM_RGN_ACCENWA_Bits.EN4 */
#define IFX_EMEM_RAM_RGN_ACCENWA_EN4_LEN (1u)

/** \brief Mask for Ifx_EMEM_RAM_RGN_ACCENWA_Bits.EN4 */
#define IFX_EMEM_RAM_RGN_ACCENWA_EN4_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_RAM_RGN_ACCENWA_Bits.EN4 */
#define IFX_EMEM_RAM_RGN_ACCENWA_EN4_OFF (4u)

/** \brief Length for Ifx_EMEM_RAM_RGN_ACCENWA_Bits.EN5 */
#define IFX_EMEM_RAM_RGN_ACCENWA_EN5_LEN (1u)

/** \brief Mask for Ifx_EMEM_RAM_RGN_ACCENWA_Bits.EN5 */
#define IFX_EMEM_RAM_RGN_ACCENWA_EN5_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_RAM_RGN_ACCENWA_Bits.EN5 */
#define IFX_EMEM_RAM_RGN_ACCENWA_EN5_OFF (5u)

/** \brief Length for Ifx_EMEM_RAM_RGN_ACCENWA_Bits.EN6 */
#define IFX_EMEM_RAM_RGN_ACCENWA_EN6_LEN (1u)

/** \brief Mask for Ifx_EMEM_RAM_RGN_ACCENWA_Bits.EN6 */
#define IFX_EMEM_RAM_RGN_ACCENWA_EN6_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_RAM_RGN_ACCENWA_Bits.EN6 */
#define IFX_EMEM_RAM_RGN_ACCENWA_EN6_OFF (6u)

/** \brief Length for Ifx_EMEM_RAM_RGN_ACCENWA_Bits.EN7 */
#define IFX_EMEM_RAM_RGN_ACCENWA_EN7_LEN (1u)

/** \brief Mask for Ifx_EMEM_RAM_RGN_ACCENWA_Bits.EN7 */
#define IFX_EMEM_RAM_RGN_ACCENWA_EN7_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_RAM_RGN_ACCENWA_Bits.EN7 */
#define IFX_EMEM_RAM_RGN_ACCENWA_EN7_OFF (7u)

/** \brief Length for Ifx_EMEM_RAM_RGN_ACCENWA_Bits.EN8 */
#define IFX_EMEM_RAM_RGN_ACCENWA_EN8_LEN (1u)

/** \brief Mask for Ifx_EMEM_RAM_RGN_ACCENWA_Bits.EN8 */
#define IFX_EMEM_RAM_RGN_ACCENWA_EN8_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_RAM_RGN_ACCENWA_Bits.EN8 */
#define IFX_EMEM_RAM_RGN_ACCENWA_EN8_OFF (8u)

/** \brief Length for Ifx_EMEM_RAM_RGN_ACCENWA_Bits.EN9 */
#define IFX_EMEM_RAM_RGN_ACCENWA_EN9_LEN (1u)

/** \brief Mask for Ifx_EMEM_RAM_RGN_ACCENWA_Bits.EN9 */
#define IFX_EMEM_RAM_RGN_ACCENWA_EN9_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_RAM_RGN_ACCENWA_Bits.EN9 */
#define IFX_EMEM_RAM_RGN_ACCENWA_EN9_OFF (9u)

/** \brief Length for Ifx_EMEM_RAM_RGN_ACCENWA_Bits.EN10 */
#define IFX_EMEM_RAM_RGN_ACCENWA_EN10_LEN (1u)

/** \brief Mask for Ifx_EMEM_RAM_RGN_ACCENWA_Bits.EN10 */
#define IFX_EMEM_RAM_RGN_ACCENWA_EN10_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_RAM_RGN_ACCENWA_Bits.EN10 */
#define IFX_EMEM_RAM_RGN_ACCENWA_EN10_OFF (10u)

/** \brief Length for Ifx_EMEM_RAM_RGN_ACCENWA_Bits.EN11 */
#define IFX_EMEM_RAM_RGN_ACCENWA_EN11_LEN (1u)

/** \brief Mask for Ifx_EMEM_RAM_RGN_ACCENWA_Bits.EN11 */
#define IFX_EMEM_RAM_RGN_ACCENWA_EN11_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_RAM_RGN_ACCENWA_Bits.EN11 */
#define IFX_EMEM_RAM_RGN_ACCENWA_EN11_OFF (11u)

/** \brief Length for Ifx_EMEM_RAM_RGN_ACCENWA_Bits.EN12 */
#define IFX_EMEM_RAM_RGN_ACCENWA_EN12_LEN (1u)

/** \brief Mask for Ifx_EMEM_RAM_RGN_ACCENWA_Bits.EN12 */
#define IFX_EMEM_RAM_RGN_ACCENWA_EN12_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_RAM_RGN_ACCENWA_Bits.EN12 */
#define IFX_EMEM_RAM_RGN_ACCENWA_EN12_OFF (12u)

/** \brief Length for Ifx_EMEM_RAM_RGN_ACCENWA_Bits.EN13 */
#define IFX_EMEM_RAM_RGN_ACCENWA_EN13_LEN (1u)

/** \brief Mask for Ifx_EMEM_RAM_RGN_ACCENWA_Bits.EN13 */
#define IFX_EMEM_RAM_RGN_ACCENWA_EN13_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_RAM_RGN_ACCENWA_Bits.EN13 */
#define IFX_EMEM_RAM_RGN_ACCENWA_EN13_OFF (13u)

/** \brief Length for Ifx_EMEM_RAM_RGN_ACCENWA_Bits.EN14 */
#define IFX_EMEM_RAM_RGN_ACCENWA_EN14_LEN (1u)

/** \brief Mask for Ifx_EMEM_RAM_RGN_ACCENWA_Bits.EN14 */
#define IFX_EMEM_RAM_RGN_ACCENWA_EN14_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_RAM_RGN_ACCENWA_Bits.EN14 */
#define IFX_EMEM_RAM_RGN_ACCENWA_EN14_OFF (14u)

/** \brief Length for Ifx_EMEM_RAM_RGN_ACCENWA_Bits.EN15 */
#define IFX_EMEM_RAM_RGN_ACCENWA_EN15_LEN (1u)

/** \brief Mask for Ifx_EMEM_RAM_RGN_ACCENWA_Bits.EN15 */
#define IFX_EMEM_RAM_RGN_ACCENWA_EN15_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_RAM_RGN_ACCENWA_Bits.EN15 */
#define IFX_EMEM_RAM_RGN_ACCENWA_EN15_OFF (15u)

/** \brief Length for Ifx_EMEM_RAM_RGN_ACCENWA_Bits.EN16 */
#define IFX_EMEM_RAM_RGN_ACCENWA_EN16_LEN (1u)

/** \brief Mask for Ifx_EMEM_RAM_RGN_ACCENWA_Bits.EN16 */
#define IFX_EMEM_RAM_RGN_ACCENWA_EN16_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_RAM_RGN_ACCENWA_Bits.EN16 */
#define IFX_EMEM_RAM_RGN_ACCENWA_EN16_OFF (16u)

/** \brief Length for Ifx_EMEM_RAM_RGN_ACCENWA_Bits.EN17 */
#define IFX_EMEM_RAM_RGN_ACCENWA_EN17_LEN (1u)

/** \brief Mask for Ifx_EMEM_RAM_RGN_ACCENWA_Bits.EN17 */
#define IFX_EMEM_RAM_RGN_ACCENWA_EN17_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_RAM_RGN_ACCENWA_Bits.EN17 */
#define IFX_EMEM_RAM_RGN_ACCENWA_EN17_OFF (17u)

/** \brief Length for Ifx_EMEM_RAM_RGN_ACCENWA_Bits.EN18 */
#define IFX_EMEM_RAM_RGN_ACCENWA_EN18_LEN (1u)

