Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEmemram_bf.h
/** \brief Mask for Ifx_EMEM_RAM_RGNACCEN_RA_Bits.EN26 */
#define IFX_EMEM_RAM_RGNACCEN_RA_EN26_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_RAM_RGNACCEN_RA_Bits.EN26 */
#define IFX_EMEM_RAM_RGNACCEN_RA_EN26_OFF (26u)

/** \brief Length for Ifx_EMEM_RAM_RGNACCEN_RA_Bits.EN27 */
#define IFX_EMEM_RAM_RGNACCEN_RA_EN27_LEN (1u)

/** \brief Mask for Ifx_EMEM_RAM_RGNACCEN_RA_Bits.EN27 */
#define IFX_EMEM_RAM_RGNACCEN_RA_EN27_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_RAM_RGNACCEN_RA_Bits.EN27 */
#define IFX_EMEM_RAM_RGNACCEN_RA_EN27_OFF (27u)

/** \brief Length for Ifx_EMEM_RAM_RGNACCEN_RA_Bits.EN28 */
#define IFX_EMEM_RAM_RGNACCEN_RA_EN28_LEN (1u)

/** \brief Mask for Ifx_EMEM_RAM_RGNACCEN_RA_Bits.EN28 */
#define IFX_EMEM_RAM_RGNACCEN_RA_EN28_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_RAM_RGNACCEN_RA_Bits.EN28 */
#define IFX_EMEM_RAM_RGNACCEN_RA_EN28_OFF (28u)

/** \brief Length for Ifx_EMEM_RAM_RGNACCEN_RA_Bits.EN29 */
#define IFX_EMEM_RAM_RGNACCEN_RA_EN29_LEN (1u)

/** \brief Mask for Ifx_EMEM_RAM_RGNACCEN_RA_Bits.EN29 */
#define IFX_EMEM_RAM_RGNACCEN_RA_EN29_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_RAM_RGNACCEN_RA_Bits.EN29 */
#define IFX_EMEM_RAM_RGNACCEN_RA_EN29_OFF (29u)

/** \brief Length for Ifx_EMEM_RAM_RGNACCEN_RA_Bits.EN30 */
#define IFX_EMEM_RAM_RGNACCEN_RA_EN30_LEN (1u)

/** \brief Mask for Ifx_EMEM_RAM_RGNACCEN_RA_Bits.EN30 */
#define IFX_EMEM_RAM_RGNACCEN_RA_EN30_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_RAM_RGNACCEN_RA_Bits.EN30 */
#define IFX_EMEM_RAM_RGNACCEN_RA_EN30_OFF (30u)

/** \brief Length for Ifx_EMEM_RAM_RGNACCEN_RA_Bits.EN31 */
#define IFX_EMEM_RAM_RGNACCEN_RA_EN31_LEN (1u)

/** \brief Mask for Ifx_EMEM_RAM_RGNACCEN_RA_Bits.EN31 */
#define IFX_EMEM_RAM_RGNACCEN_RA_EN31_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_RAM_RGNACCEN_RA_Bits.EN31 */
#define IFX_EMEM_RAM_RGNACCEN_RA_EN31_OFF (31u)

/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXEMEM_RAM_BF_H */
